of-6/OpenFOAM-6-master/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 2)
    (1 0 2)
    (1 1 2)
    (0 1 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (10 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    side
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 1 5 4)
            (7 6 2 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
           (4 5 6 7)
        );
    }

    ground
    {
        type wall;
        faces
        (
           (0 3 2 1)
        );
    }

    coupledWallTmp
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
