of-6/OpenFOAM-6-master/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

surfaceFilmModel thermoSingleLayer;

regionName      filmRegion;

thermoSingleLayerCoeffs
{
    filmThermoModel liquid;
    liquidCoeffs
    {
        useReferenceValues  no;
        liquid          H2O;
    }
    filmViscosityModel  liquid;

    hydrophilic     no;
    deltaWet        1e-4;

    turbulence      laminar;
    laminarCoeffs
    {
        Cf              0.005;
    }

    radiationModel  none;
    standardRadiationCoeffs
    {
        beta     0.75;
        kappaBar 0.25;
    }

    upperSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
           c0              10;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0             100;
        }
    }

    injectionModels
    ();

    forces
    (
        thermocapillary
    );

    phaseChangeModel standardPhaseChange;

    standardPhaseChangeCoeffs
    {
        Tb              373;
        deltaMin        1e-8;
        L               1.0;
    }
}
